{
  "pokemon": [
    {
      "id": 5,
      "name": "P Diddy",
      "image": "https://frostsnow.com/uploads/biography/2017/05/17/p-diddy.jpg",
      "content": "Sean John Combs (born November 4, 1969),[7] also known by his various stage names Puff Daddy, P. Diddy, Diddy, Puffy, and Brother Love, is an American rapper, singer, songwriter, actor, record producer, and entrepreneur. Combs was born in New York City but raised in Mount Vernon, New York. He worked as a talent director at Uptown Records before founding his own record label, Bad Boy Entertainment, in 1993.  Combs' debut album, No Way Out (1997) has been certified seven times platinum. No Way Out was followed by successful albums such as Forever (1999), The Saga Continues... (2001) and Press Play (2006). In 2009, Combs formed the musical group Diddy – Dirty Money and released the critically well-reviewed and commercially successful album Last Train to Paris (2010).  Combs has won three Grammy Awards and two MTV Video Music Awards, and is the producer of MTV's Making the Band. In 2018, Forbes estimated his net worth at $825 million, making him the second-richest hip hop recording artist"
    },
    {
      "id": 8,
      "name": "Dr Dre",
      "image": "https://music-b26f.kxcdn.com/wp-content/uploads/2015/08/dr-dre-banner-600x600.jpg",
      "content": "Andre Romelle Young[3]:1 (born February 18, 1965),[4] known professionally as Dr. Dre, is an American rapper, record producer, and entrepreneur. He is the founder and CEO of Aftermath Entertainment and Beats Electronics, and was previously co-owner of Death Row Records. He has produced albums for and overseen the careers of many rappers, including 2Pac, The D.O.C., Snoop Dogg, Eminem, Xzibit, Knoc-turn'al, 50 Cent, The Game, and Kendrick Lamar. He is credited as a key figure in the crafting and popularization of West Coast G-funk, a rap style characterized as synthesizer-based with slow, heavy beats. As of 2018, he is the third richest figure in hip hop, with a net worth of $770 million.[5]  Dre began his career as a member of the World Class Wreckin' Cru. He found fame with the influential gangsta rap group N.W.A with Eazy-E, Ice Cube, MC Ren, and DJ Yella, which popularized explicit lyrics in rap to detail the violence of street life. His 1992 solo debut The Chronic, released under Death Row Records, made him one of the best-selling American performing artists of 1993, and earned him a Grammy Award for the single \"Let Me Ride\". That year, he produced Death Row labelmate Snoop Dogg's quadruple platinum debut Doggystyle, and mentored producers such as his step-brother Warren G (leading to the multi-platinum debut Regulate...G Funk Era in 1994) and Snoop Dogg's cousin Daz Dillinger (leading to the double-platinum debut Dogg Food by Tha Dogg Pound in 1995).  In 1996, Dr. Dre left Death Row Records to establish his own label, Aftermath Entertainment. He produced a compilation album, Dr. Dre Presents the Aftermath, in 1996, and released a solo album, 2001, in 1999. During the 2000s, Dr. Dre focused on producing other artists, occasionally contributing vocals. Dr. Dre signed Eminem in 1998 and 50 Cent in 2002, and co-produced their albums. He has won six Grammy Awards, including Producer of the Year. Dr. Dre has had acting roles in movies such as Set It Off, The Wash and Training Day. Rolling Stone ranked Dre 56 on their list of \"100 Greatest Artists of All Time\""
    },
    {
      "id": 10,
      "name": "Snoop Dogg",
      "image": "https://pbs.twimg.com/profile_images/943933166015803392/jvjasD7v_400x400.jpg",
      "content": " Snoop Dogg Snoop Dogg 2016.jpg Snoop Dogg in 2016 Born\tCalvin Cordozar Broadus Jr. October 20, 1971 (age 47) Long Beach, California, U.S. Other names\t DJ Snoopadelic Niggarachi[1] Snoop Doggy Dogg Snoop Lion Snoopzilla Nemo Hoes[2] Occupation\t Rapper singer songwriter record producer actor television producer entrepreneur Years active\t1991–present Organization\tSnoop Youth Football League Net worth\tUS$124 million[3] (2017) Television\t Doggy Fizzle Televizzle Snoop Dogg's Father Hood Dogg After Dark The Joker's Wild Martha & Snoop's Potluck Dinner Party Clout Chasers Spouse(s)\tShante Taylor (m. 1997; div. 2004) (m. 2008) Children\t4 Relatives\tBrandy Norwood (cousin) Ray J (cousin) Sasha Banks (cousin)[4] Daz Dillinger (cousin) Nate Dogg (cousin) Awards\tList of awards and nominations Musical career Genres\t Hip hop funk gangsta rap reggae Instruments\tVocals Labels\t EMPIRE Doggystyle RCA Inspiration (current) Death Row Interscope No Limit Priority TVT EMI Capitol Star Trak Geffen Atlantic Mad Decent Vice RCA Stones Throw i am OTHER Columbia E1 MySpace (inactive/former) Associated acts\t 213 7 Days of Funk Tha Eastsidaz QDT 50 Cent Akon B-Real Battlecat Charlie Wilson Doggy's Angels Dr. Dre Major Lazer Master P Nate Dogg Pharrell R. Kelly Soopafly Too Short Tha Dogg Pound Wiz Khalifa Tupac Shakur Website\tsnoopdogg.com Calvin Cordozar Broadus Jr. (born October 20, 1971), known professionally as Snoop Dogg,[note 1] is an American rapper, singer, record producer, television personality, entrepreneur, and actor. His music career began in 1992 when he was discovered by Dr. Dre and featured on Dre's solo debut, \"Deep Cover\", and then on Dre's solo debut album, The Chronic. He has since sold over 23 million albums in the United States and 35 million albums worldwide.[5][6][7]  Snoop's debut album, Doggystyle, produced by Dr. Dre, was released in 1993 by Death Row Records. Bolstered by excitement driven by Snoop's featuring on The Chronic, the album debuted at number one on both the Billboard 200 and Billboard Top R&B/Hip-Hop Albums charts. Selling almost a million copies in the first week of its release, Doggystyle became certified quadruple platinum in 1994 and spawned several hit singles, including \"What's My Name?\" and \"Gin & Juice\". In 1994 Snoop released a soundtrack on Death Row Records for the short film Murder Was the Case, starring himself. His second album, Tha Doggfather (1996), also debuted at number one on both charts, with \"Snoop's Upside Ya Head\" as the lead single. The album was certified double platinum in 1997.  After leaving Death Row Records, Snoop signed with No Limit Records, where he recorded his next three albums, Da Game Is to Be Sold, Not to Be Told (1998), No Limit Top Dogg (1999), and Tha Last Meal (2000). Snoop then signed with Priority/Capitol/EMI Records in 2002, where he released Paid tha Cost to Be da Boss. He then signed with Geffen Records in 2004 for his next three albums, R&G (Rhythm & Gangsta): The Masterpiece, Tha Blue Carpet Treatment, and Ego Trippin'. Malice 'n Wonderland (2009), and Doggumentary (2011) were released on Priority. Snoop Dogg has starred in motion pictures and hosted several television shows, including Doggy Fizzle Televizzle, Snoop Dogg's Father Hood, and Dogg After Dark. He also coaches a youth football league and high school football team. In September 2009 Snoop was hired by EMI as the chairman of a reactivated Priority Records.[8]  In 2012, after a trip to Jamaica, Snoop announced a conversion to Rastafarianism and a new alias, Snoop Lion. As Snoop Lion he released a reggae album, Reincarnated, and a documentary film of the same name, about his Jamaican experience, in early 2013. His 13th studio album, Bush, was released in May 2015 and marked a return of the Snoop Dogg name. His 14th solo studio album, Coolaid, was released in July 2016. Snoop has 17 Grammy nominations without a win. In March 2016, the night before WrestleMania 32 in Arlington, Texas, he was inducted into the celebrity wing of the WWE Hall of Fame, having made several appearances for the company, including as Master of Ceremonies during a match at WrestleMania XXIV.[9] In 2018, he released his first gospel album, Bible of Love. On November 19, 2018, Snoop Dogg was given a star on the Hollywood Walk of Fame."
    },
    {
      "name": "Kanye West",
      "image": "https://s3.amazonaws.com/hwingcdn/wp-content/uploads/2017/06/04205843/rs_600x600-170211120220-600.kanye-west.cm_.21117.jpg",
      "id": 13,
      "content": "Kanye Omari West (/ˈkɑːnjeɪ/; born June 8, 1977) is an American rapper, singer, songwriter, record producer, entrepreneur and fashion designer. His musical career has been marked by dramatic changes in styles, incorporating an eclectic range of influences including soul, baroque pop, electro, indie rock, synth-pop, industrial and gospel. Over the course of his career, West has been responsible for cultural movements and progressions within mainstream hip hop and popular music at large.  Born in Atlanta and raised in Chicago, West first became known as a producer for Roc-A-Fella Records in the early 2000s, producing hit singles for recording artists such as Jay-Z, Ludacris and Alicia Keys. Intent on pursuing a solo career as a rapper, West released his debut album The College Dropout in 2004 to widespread critical and commercial success, and founded the record label GOOD Music. He went on to experiment with a variety of musical genres on subsequent acclaimed studio albums, including Late Registration (2005), Graduation (2007), and the polarizing but influential 808s & Heartbreak (2008). He released his fifth album My Beautiful Dark Twisted Fantasy in 2010 to further rave reviews, and has since succeeded it with Yeezus (2013) ,The Life of Pablo (2016) and Ye (2018), as well as full-length collaborations Watch the Throne (2011) and Kids See Ghosts (2018) with Jay-Z and Kid Cudi respectively.  West's outspoken views and life outside of music have received significant media attention. He has been a frequent source of controversy for his conduct at award shows, on social media, and in other public settings, as well as his comments on the music and fashion industries, U.S. politics, and race. His marriage to television personality Kim Kardashian has also been a source of substantial media attention. As a fashion designer, he has collaborated with Nike, Louis Vuitton, and A.P.C. on both clothing and footwear, and have most prominently resulted in the Yeezy collaboration with Adidas beginning in 2013. He is the founder and head of the creative content company DONDA.  West is among the most critically acclaimed musicians of the 21st century and one of the best-selling music artists of all time with over 120 million records sold worldwide.[4] He has won a total of 21 Grammy Awards, making him one of the most awarded artists of all time and the most Grammy-awarded artist of his generation.[5] Three of his albums have been included and ranked on Rolling Stone's 2012 update of the \"500 Greatest Albums of All Time\" list and he ties with Bob Dylan for having topped the annual Pazz & Jop critic poll the most number of times ever, with four number-one albums each. Time magazine named him one of the 100 most influential people in the world in 2005 and 2015"
    },
    {
      "name": "Drake",
      "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/06/28/drake/28-drake-2.w700.h700.jpg",
      "content": "Aubrey Drake Graham[7] (born October 24, 1986) is a Canadian rapper, singer, songwriter, record producer, actor, and entrepreneur.[8] Drake initially gained recognition as an actor on the teen drama television series Degrassi: The Next Generation in the early 2000s. Intent on pursuing a career as a rapper, he departed the series in 2007 following the release of his debut mixtape, Room for Improvement. He released two further independent projects, Comeback Season and So Far Gone, before signing to Lil Wayne's Young Money Entertainment in June 2009.[9]  Drake released his debut studio album Thank Me Later in 2010,[10] which debuted at number one on the US Billboard 200 and was soon certified platinum. His next two releases, 2011's Take Care and 2013's Nothing Was the Same,[11][12] were critically and commercially successful; the former earned him his first Grammy Award for Best Rap Album. In 2015, he released two mixtapes—the trap-influenced If You're Reading This It's Too Late and a collaboration with Future titled What a Time to Be Alive—both of which earned platinum certification in the U.S.[13]  His fourth album, Views (2016), broke several chart records.[14] The dancehall-influenced album[15][16] sat atop the Billboard 200 for 13 nonconsecutive weeks,[17] becoming the first album by a male solo artist to do so in over 10 years. The album's second single, \"One Dance\", topped the charts in several countries, and became his first number-one single as a lead artist. That year, Drake led both the Billboard Hot 100 and the Billboard 200 charts simultaneously for eight weeks.[18] Views achieved quadruple platinum status in the US, and earned over 1 million album-equivalent units in the first week of its release.[19][20] Its lead single \"Hotline Bling\" received Grammy Awards for Best Rap/Sung Performance and Best Rap Song.[21] In 2017, he released the mixtape More Life. Described by Drake as a \"playlist\",[22][23] it became his seventh consecutive number one on the Billboard 200, and set multiple streaming records.[24] A year later, he released the double album Scorpion, which also broke several streaming records,[25] and housed the number-one singles \"God's Plan\", and the bounce-infused \"Nice for What\" and \"In My Feelings\".  Drake holds several Billboard chart records. He has the most charted songs (186) among solo artists in the history of the Billboard Hot 100, the most simultaneously charted Hot 100 songs in a single week (27), the most time on the Hot 100 (431 weeks) and the most Hot 100 debuts in a week (22).[26] He also has the most number one singles on the Hot Rap Songs, Hot R&B/Hip-Hop Airplay and Rhythmic Charts.[27][28] Drake has also won three Juno Awards, six American Music Awards, and fifteen Billboard Music Awards. He is the RIAA's top certified digital singles artist and one of the world's best-selling music artists, with more than 12 million albums and 95 million singles sold globally.[29][30][31] As an entrepreneur, Drake has founded the OVO Sound record label with longtime collaborator 40, as well as using the \"OVO\" moniker to create a clothing line and program on Beats 1 Radio.",
      "id": 15
    },
    {
      "name": "Lil Wayne",
      "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/06/07/07-lil-wayne.w330.h330.jpg",
      "content": "Dwayne Michael Carter Jr. (born September 27, 1982),[2] known professionally as Lil Wayne, is an American rapper. In 1993, at the age of 11, he was discovered by Bryan \"Birdman\" Williams and joined Cash Money Records as the youngest member of the label, and half of the duo The B.G.'z, alongside fellow New Orleans-based rapper B.G.. In 1996, Lil Wayne and B.G. joined the southern hip hop group Hot Boys, with Cash Money label-mates Juvenile and Turk. Hot Boys debuted with Get It How U Live!, that same year. Most of the group's success came with their platinum-selling album Guerrilla Warfare (1999) and the 1999 single \"Bling Bling\". For many years, he was the flagship artist of Cash Money Records, before ending his long-tenured deal with the company in June 2018.[3]  Lil Wayne's solo debut album Tha Block Is Hot (1999) was certified platinum by the Recording Industry Association of America (RIAA). His subsequent albums, Lights Out (2000) and 500 Degreez (2002), went on to be certified gold. Wayne reached higher popularity with his fourth album Tha Carter (2004), which was led by the single \"Go D.J.\" and his appearance on Destiny's Child's Top 10 single \"Soldier\", that same year. The album was followed by Tha Carter II (2005), as well as several mixtapes and collaborations throughout 2006 and 2007. Wayne gained more prominence with his sixth album Tha Carter III (2008), which became his most successful album to date, with first-week sales of over one million copies in the United States. The album won the Grammy Award for Best Rap Album and includes the singles \"Lollipop\", \"A Milli\" and \"Got Money\".  Following the success of Tha Carter III, Wayne decided to record a rock-esque album titled Rebirth. The album, released in 2010, was certified gold by the RIAA, despite a generally negative critical response. In March 2010, Lil Wayne began serving an 8-month jail sentence in New York after being convicted of criminal possession of a weapon stemming from an incident in July 2007. Wayne's eighth album I Am Not a Human Being (2010), was released during his incarceration. His 2011 album and first following his release, Tha Carter IV, sold 964,000 copies in its first week of availability in the United States. It includes the singles \"6 Foot 7 Foot\", \"How to Love\" and \"She Will\".[4] On September 27, 2012, Lil Wayne passed Elvis Presley as the male with the most entries on the Billboard Hot 100 chart, with 109 songs. The record has since been passed by other artists.[5] His twelfth studio album, Tha Carter V, was released in 2018 after multiple delays. The album sold 480,000 copies first week, it went on to be certified platinum. Lil Wayne has sold over 100 million records worldwide, including more than 15 million albums and 37 million digital tracks in the United States, making him one of the best-selling artists of all time.[6][7][8] Lil Wayne also currently serves as the Chief Executive Officer (CEO) of his own label imprint, Young Money Entertainment.",
      "id": 16
    },
    {
      "name": "2 Chainz",
      "image": "https://i.scdn.co/image/8a0f9090548262a85cceef38650642d3037fd1e0",
      "content": "Tauheed Epps (born September 12, 1977),[2][3] known professionally as 2 Chainz (formerly Tity Boi), is an American rapper, songwriter, television personality, activist, and actor. Born and raised in College Park, Georgia, he initially gained recognition for being one-half of the Southern hip hop duo Playaz Circle, alongside his longtime friend and fellow rapper Earl \"Dolla Boy\" Conyers. The duo was signed to fellow Georgia-based rapper Ludacris' Disturbing tha Peace label, and are best known for their debut single \"Duffle Bag Boy\".  In February 2012, Epps signed a solo record deal with Def Jam Recordings, an imprint of Universal Music Group. The following August, he released his debut studio album Based on a T.R.U. Story, to mixed reviews.[4] The album spawned three successful singles: \"No Lie,\" \"Birthday Song,\" and \"I'm Different\", all of which charted in the top 50 of the Billboard Hot 100 and were certified Gold or higher by the RIAA, along with the album being certified Gold. His second studio album B.O.A.T.S. II: Me Time was released on September 11, 2013. It was supported by the singles \"Feds Watching\" and \"Used 2\". Mr. Chainz began working with the TV Network Viceland on a show called Most Expensivest, which debuted its first episode on November 15, 2017, and is currently in its second season.",
      "id": 17
    },
    {
      "name": "Asap Rocky",
      "image": "https://www.meme-arsenal.com/memes/a9551e4a46b364d7defe32f4d373ee12.jpg",
      "content": " ASAP Rocky A$AP Rocky UIT 2013 (cropped) (cropped).jpg Mayer performing in December 2013 Background information Birth name\tRakim Mayers Born\tOctober 3, 1988 (age 30) New York City, U.S. Genres\tHip hop Occupation(s)\t Rapper songwriter record producer actor model Years active\t2007–present Labels\t ASAP Worldwide Polo Grounds RCA Associated acts\t ASAP Mob Danny Brown French Montana Juicy J Playboi Carti Lana Del Rey Schoolboy Q Tyler, the Creator Website\twww.asvpxrocky.com Rakim Mayers (born October 3, 1988), known by his stage name ASAP Rocky (stylized as A$AP Rocky), is an American rapper, songwriter, record producer, actor and model. He is a member of the hip hop group A$AP Mob, from which he adopted his moniker.  Rocky released his debut mixtape Live. Love. A$AP, in 2011 to critical acclaim. The success of his mixtape led to a record deal with Polo Grounds Music, RCA Records, and Sony Music Entertainment. He subsequently recorded his 2013 debut album Long. Live. A$AP, which was also well received by critics and debuted at number one on the Billboard 200. In 2015, Rocky released his second studio album titled At. Long. Last. A$AP. The album debuted at number one on the Billboard 200, making it Rocky's second consecutive album to debut at number one and has received positive reviews from music critics.  Rocky has also directed music videos for himself, Danny Brown, SpaceGhostPurrp and other A$AP Mob members.[1] He is also a noted record producer, producing under the pseudonym Lord Flacko.",
      "id": 18
    }
  ]
}